Revit 2027 API
EnergyDataSettings.DividePerimeter Property
 If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DividePerimeter { get; set; }
Public Property DividePerimeter As Boolean
	Get
	Set
public:
property bool DividePerimeter {
	bool get ();
	void set (bool value);
}
member DividePerimeter : bool with get, set
Property Value
Boolean
Remarks
 Only works if AnalysisType is ConceptualMassesAndBuildingElements, the division of the perimeter zones is based on the difference of orientation, maximum length and depth. Any exterior surfaces that have an angle of 45 degrees or more between them will be divided into separate zones. Zones greater than 50 ft. will be divided equally. The CoreOffset will determine the depth of the zones. The purpose of these divisions is to ensure that auto-generated zoning is appropriate for thermal loads generated by the relative position of the building to the sun path.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace